time.org
Time in seconds from "real" output from command "time"

new nb = i5 dual core 2.9Ghz 8Gb

ns parece mais lento, mas teve algo mais entre 1.4.2 e ns q causou a
lentidao, ver token 1. ns não causou mais lentidão, foi outra coisa

remember to turn web interface off

* token 1

| java   | jason         | tempo (real) |
|--------+---------------+--------------|
| java 8 | agere13       |          4.5 |
|        | hash in clone |          4.6 |
| new nb | jason 1.4.2   |          4.2 |
|        | pre ns        |          5.1 |
|        | ns            |          5.1 |
|        | maicon        |          5.2 |
|        | jason 2.0     |          4.3 |
|        |               |              |

* token 2

| java   | jason         | tempo (real) |
|--------+---------------+--------------|
| java 8 | agere13       |           43 |
|        | hash in clone |           33 |
| new nb | jason 1.4.2   |           39 |
|        | ns            |           45 |
|        | maicon        |           46 |
|        | pool,4,5      |           33 |
|        | jason 2.0     |           31 |
|        |               |              |

* token 3

| java   | jason         | tempo (real) |
|--------+---------------+--------------|
| java 8 | agere13       |           17 |
|        | hash in clone |            6 |
| new nb | jason 1.4.2   |            8 |
|        | ns            |            9 |
|        | maicon        |            8 |
|        | pool,8,1,1,10 |            4 |
|        | jason 2.0     |          3.3 |
|        |               |              |

* fat

| java   | jason         | tempo (real) |
|--------+---------------+--------------|
| java 8 | hash in clone |          2.0 |
| new nb | jason 1.4.2   |          1.7 |
|        | ns            |          1.7 |
|        | maicon        |          1.7 |
|        | jason 2.0     |          1.3 |
|        |               |              |

* fib

| java   | jason             | tempo (real) |
|--------+-------------------+--------------|
| java 8 | agere13           |           27 |
|        | hash in clone     |           24 |
| new nb | jason 1.4.2       |           19 |
|        | ns                |           18 |
|        | maicon            |           18 |
|        | pool,4,1,1,10,5   |           14 |
|        | pool,4,1,40,40,5  |           13 |
|        | threads           |           13 |
|        | asynch,1,1,2,1,40 |           13 |
|        | jason 2.0         |           11 |
|        |                   |              |

* so-fib

| java   | jason         | tempo (real) |
|--------+---------------+--------------|
| java 8 | hash in clone |          3.8 |
| new nb | jason 1.4.2   |          3.2 |
|        | ns            |          3.1 |
|        | maicon        |          3.0 |
|        | jason 2.0     |          2.7 |
|        |               |              |

* internal action performance

| java   | jason         | tempo (real) |
|--------+---------------+--------------|
| java 8 | hash in clone |          2.2 |
| new nb | jason 1.4.2   |          2.0 |
|        | ns            |          2.1 |
|        | maicon        |          1.9 |
|        | jason 2.0     |          1.7 |
|        |               |              |

* search

| java   | jason         | tempo medido pelo programa (rule/plan) | tempo (real) |
|--------+---------------+----------------------------------------+--------------|
| java 8 | hash in clone | 119/57                                 |          4.1 |
| new nb | jason 1.4.2   | 117/68                                 |          4.2 |
|        | ns            | 152/61                                 |          4.7 |
|        | main          | 159/61                                 |          4.6 |
|        | jason 2.0     | 106/55                                 |          3.7 |
|        |               |                                        |              |

* st claus

| java   | jason         | tempo (real) |
|--------+---------------+--------------|
| java 8 | agere13       |         0.48 |
|        | hash in clone |         0.84 |
| new nb | jason 1.4.2   |         0.88 |
|        | ns            |         0.89 |
|        | maicon        |         0.52 |
| n=2000 |               |           11 |
|        | jason 2.0     |           11 |
|        |               |              |

* bufeval

| java   | jason     | tempo (real) |
|--------+-----------+--------------|
| java 8 |           |              |
| new nb | buf n^2   |           40 |
| new nb | buf 3n    |            5 |
|        | maicon    |            5 |
|        | jason 2.0 |            5 |
|        |           |              |


