time.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>time</title>
<!-- 2016-10-26 Wed 19:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jomi Fred Hubner" />
</head>
<body>
<div id="content">
<h1 class="title">time</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. token 1</a></li>
<li><a href="#sec-2">2. token 2</a></li>
<li><a href="#sec-3">3. token 3</a></li>
<li><a href="#sec-4">4. fat</a></li>
<li><a href="#sec-5">5. fib</a></li>
<li><a href="#sec-6">6. so-fib</a></li>
<li><a href="#sec-7">7. internal action performance</a></li>
<li><a href="#sec-8">8. search</a></li>
<li><a href="#sec-9">9. st claus</a></li>
<li><a href="#sec-10">10. bufeval</a></li>
</ul>
</div>
</div>
<p>
Time in seconds from "real" output from command "time"
</p>

<p>
new nb = i5 dual core 2.9Ghz 8Gb
</p>

<p>
ns parece mais lento, mas teve algo mais entre 1.4.2 e ns q causou a
lentidao, ver token 1. ns não causou mais lentidão, foi outra coisa
</p>

<p>
remember to turn web interface off
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> token 1</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">agere13</td>
<td class="right">4.5</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">hash in clone</td>
<td class="right">4.6</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="right">4.2</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">pre ns</td>
<td class="right">5.1</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="right">5.1</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">5.2</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">4.3</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> token 2</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">agere13</td>
<td class="right">43</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">hash in clone</td>
<td class="right">33</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="right">39</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="right">45</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">46</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">pool,4,5</td>
<td class="right">33</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">31</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> token 3</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">agere13</td>
<td class="right">17</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">hash in clone</td>
<td class="right">6</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="right">8</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="right">9</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">8</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">pool,8,1,1,10</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">3.3</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> fat</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">hash in clone</td>
<td class="right">2.0</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="right">1.7</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="right">1.7</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">1.7</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">1.3</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> fib</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">agere13</td>
<td class="right">27</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">hash in clone</td>
<td class="right">24</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="right">19</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="right">18</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">18</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">pool,4,1,1,10,5</td>
<td class="right">14</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">pool,4,1,40,40,5</td>
<td class="right">13</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">threads</td>
<td class="right">13</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">asynch,1,1,2,1,40</td>
<td class="right">13</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">11</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> so-fib</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">hash in clone</td>
<td class="right">3.8</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="right">3.2</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="right">3.1</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">3.0</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">2.7</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> internal action performance</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">hash in clone</td>
<td class="right">2.2</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="right">2.0</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="right">2.1</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">1.9</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">1.7</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> search</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="left">tempo medido pelo programa (rule/plan)</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">hash in clone</td>
<td class="left">119/57</td>
<td class="right">4.1</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="left">117/68</td>
<td class="right">4.2</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="left">152/61</td>
<td class="right">4.7</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">main</td>
<td class="left">159/61</td>
<td class="right">4.6</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="left">106/55</td>
<td class="right">3.7</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> st claus</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">agere13</td>
<td class="right">0.48</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">hash in clone</td>
<td class="right">0.84</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">jason 1.4.2</td>
<td class="right">0.88</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ns</td>
<td class="right">0.89</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">0.52</td>
</tr>

<tr>
<td class="left">n=2000</td>
<td class="left">&#xa0;</td>
<td class="right">11</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">11</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> bufeval</h2>
<div class="outline-text-2" id="text-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">java</th>
<th scope="col" class="left">jason</th>
<th scope="col" class="right">tempo (real)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">java 8</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">buf n<sup>2</sup></td>
<td class="right">40</td>
</tr>

<tr>
<td class="left">new nb</td>
<td class="left">buf 3n</td>
<td class="right">5</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">maicon</td>
<td class="right">5</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">jason 2.0</td>
<td class="right">5</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jomi Fred Hubner</p>
<p class="date">Created: 2016-10-26 Wed 19:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.51.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>